/*----------------------------------------------------------------------------*/
/*  utf8.h                                                                    */
/*----------------------------------------------------------------------------*/
/*  copyright         : (C) 2002 by Dao Hai Lam                               */
/*                      VISC Software & Security Consultant Company           */
/*                      Hall 3, Quang Trung Software City                     */
/*                      Tan Chanh Hiep Ward, District 12,                     */
/*                      Ho Chi Minh city, VIETNAM                             */
/*  website           : http://www.visc-network.com                           */
/*  email             : lam@visc-network.com                                  */
/*  last modify       : Thu, 18 Apr 2002 22:00:33 +0700                       */
/*----------------------------------------------------------------------------*/
/*                                                                            */
/*   This program is free software; you can redistribute it and/or modify     */
/*   it under the terms of the GNU General Public License as published by     */
/*   the Free Software Foundation; either version 2 of the License, or        */
/*   (at your option) any later version.                                      */
/*                                                                            */
/*----------------------------------------------------------------------------*/

char *UTF8[] = {
    "A","Á","À","Ả","Ã","Ạ",
    "Â","Ấ","Ầ","Ẩ","Ẫ","Ậ",
    "Ă","Ắ","Ằ","Ẳ","Ẵ","Ặ",
    "E","É","È","Ẻ","Ẽ","Ẹ",
    "Ê","Ế","Ề","Ể","Ễ","Ệ",
    "O","Ó","Ò","Ỏ","Õ","Ọ",
    "Ô","Ố","Ồ","Ổ","Ỗ","Ộ",
    "Ơ","Ớ","Ờ","Ở","Ỡ","Ợ",
    "U","Ú","Ù","Ủ","Ũ","Ụ",
    "Ư","Ứ","Ừ","Ử","Ữ","Ự",
    "I","Í","Ì","Ỉ","Ĩ","Ị",
    "Y","Ý","Ỳ","Ỷ","Ỹ","Ỵ",
    "Đ",
    "a","á","à","ả","ã","ạ",
    "â","ấ","ầ","ẩ","ẫ","ậ",
    "ă","ắ","ằ","ẳ","ẵ","ặ",
    "e","é","è","ẻ","ẽ","ẹ",
    "ê","ế","ề","ể","ễ","ệ",
    "o","ó","ò","ỏ","õ","ọ",
    "ô","ố","ồ","ổ","ỗ","ộ",
    "ơ","ớ","ờ","ở","ỡ","ợ",
    "u","ú","ù","ủ","ũ","ụ",
    "ư","ứ","ừ","ử","ữ","ự",
    "i","í","ì","ỉ","ĩ","ị",
    "y","ý","ỳ","ỷ","ỹ","ỵ",
    "đ",
    "₫"
};
/*----------------------------------------------------------------------------*/
